## Лабораторная работа 2 – TFTP-сервер

### Инструкция по запуску
Запускается из командной строки:  
`python3 tftp_server.py -ip <ip> -p <port> -t <timeout>`  
или   
`python3 tftp_server.py -p <port> -t <timeout>` – в этом случае по дефолту будет выбран ip = 0.0.0.0

### Тестирование работы
Работа сервера была протестирована с помощью клиента [tftp](https://linux.die.net/man/1/tftp). Примеры работы:  

**запрос клиента на запись файла на сервер**  
```
$ tftp 127.0.0.1 8093             
tftp> trace
Packet tracing on.
tftp> put file_to_put.txt
sent WRQ <file=file_to_put.txt, mode=netascii>
received ACK <block=0>
sent DATA <block=1, 11 bytes>
received ACK <block=1>
Sent 11 bytes in 0.0 seconds
```
**ответ сервера**
```
$ python3 tftp_server.py 8093 1000
___Server is ready!___
Received WRQ
Sent ACK 0
Received DATA  1
Sent ACK 1
```

**запрос на получение файла с сервера**  
```
tftp> get hello.txt
sent RRQ <file=hello.txt, mode=netascii>
received DATA <block=1, 14 bytes>
Received 14 bytes in 0.0 seconds
```
**ответ сервера**
```
Received RRQ
Sent DATA 1
Received ACK 1
```

**запрос на получение несуществующего файла**  
```
tftp> get a.txt
sent RRQ <file=a.txt, mode=netascii>
received ERROR <code=1, msg=File does not exist>
Error code 256: File does not exist
```
**ответ сервера**
```
Sent ERROR
Received ACK 1
```
---
### Описание протокола
#### Формат пакетов
В TFTP-протоколе используется 5 типов пакетов:  
* **Чтение файла с сервера RRQ – `get filename.*`**

Тип пакета | Имя файла | Режим передачи
------------ | ------------- | -------------
0x01 | Строка | Строка (netascii / octet)

После получения RRQ-пакета сервером, он сразу начинает передачу данных.

* **Запись файла на сервер WRQ – `put filename.*`**

Тип пакета | Имя файла | Режим передачи
------------ | ------------- | -------------
0x02 | Строка | Строка (netascii / octet)

В начале сервер присылает ACK-пакет c номером пакета 0, а затем начинает получать файл.

* **Передаваемые данные DATA**

Тип пакета | Номер блока | Данные
------------ | ------------- | -------------
0x03 | 2 байта | Строка

* **Подтверждение пакета ACK**

Тип пакета | Номер блока
------------ | -------------
0x04 | 2 байта

* **Сообщение об ошибке ERROR**

Тип пакета | Код ошибки | Сообщение
------------ | ------------- | -------------
0x05 | 2 байта | Строка

#### Ошибки

Код ошибки | Описание
------------ | -------------
0 | Нет определенного кода, см. текст ошибки
1 | Файл не найден
2 | Доступ запрещен
3 | Невозможно выделить место на диске
4 | Некорректная TFTP-операция
5 | Неправильный Transfer ID
6 | Файл уже существует
7 | Пользователь не существует
8 | Неправильная опция

#### Процесс передачи данных
После получения RRQ-пакета сервером, он сразу посылает в качестве подтверждения пакет с данными и с ID пакета, равным единице. В случае с WRQ-запросом — сервер должен прислать ACK-пакет c номером пакета 0.

Каждый пакет данных содержит номер блока (block number), который затем используется в пакете подтверждения. Каждый пакет данных содержит 512 байт данных, за исключением последнего пакета, который содержит от 0 до 511 байт данных. Когда клиент получает пакет данных, который содержит меньше, чем 512 байт, он считает, что получил последний пакет.